source/hdk2/hdk2/libhnap12/unittest/tests/WLanRadioSecurity/set-encryption-bad.request

SOAPAction: "http://purenetworks.com/HNAP1/SetWLanRadioSecurity"

﻿<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
      <RadioID>RADIO_2.4GHz</RadioID>
      <Enabled>true</Enabled>
      <Type>WEP-OPEN</Type>
      <Encryption>TKIP</Encryption>
      <Key>01234567890123456789012345</Key>
      <KeyRenewal>0</KeyRenewal>
      <RadiusIP1>94.9.1.226</RadiusIP1>
      <RadiusPort1>1812</RadiusPort1>
      <RadiusSecret1>...))0</RadiusSecret1>
      <RadiusIP2 />
      <RadiusPort2>0</RadiusPort2>
      <RadiusSecret2 />
    </SetWLanRadioSecurity>
  </soap:Body>
</soap:Envelope>
